Repository: libpwquality/libpwquality
Catalog: po/*.po
Languages: kk, ko, ro

source: BAD PASSWORD: %s
kk: ҚАТЕ ПАРОЛЬ: %s
ko: 불량한 비밀번호: %s
ro: PAROLĂ INCORECTĂ: %s

source: Usage: %s [user]
kk: Қолданылуы: %s [пайдаланушы]
ko: 사용법: %s [<사용자>]
ro: Utilizare: %s [utilizator]

source: The command reads the password to be scored from the standard input.
kk: Команда енгізілген парольдің сапасын тексереді.
ko: 이 명령은 표준 입력에서 수준을 검사할 비밀번호를 읽습니다.
ro: Comanda citește parola care urmează să fie evaluată de la intrarea standard.

source: Error: %s
kk: Қате: %s
ko: 오류: %s
ro: Eroare: %s

source: Could not obtain the password to be scored
kk: Тексеру үшін парольді алу сәтсіз аяқталды
ko: 수준을 검사할 비밀번호를 가져올 수 없습니다
ro: Nu s-a putut obține parola pentru a fi evaluată

source: Password quality check failed: %s
kk: Пароль сапасын тексеру сәтсіз аяқталды: %s
ko: 비밀번호 수준 검사에 실패했습니다: %s
ro: Verificarea calității parolei a eșuat: %s

source: Usage: %s <entropy-bits>
kk: Қолданылуы: %s <энтропия-биттері>
ko: 사용법: %s <엔트로피-비트>
ro: Utilizare: %s <biți de entropie>

source: Warning: Value %ld is outside of the allowed entropy range, adjusting it.
kk: Ескерту: %ld мәні рұқсат етілген энтропия ауқымынан тыс, оны реттейміз.
ko: 경고: 값 %ld는 허용된 엔트로피 범위를 초과하였으며, 이를 조정하세요.
ro: Avertisment: Valoarea %ld este în afara intervalului de entropie permis, ajustându-l.

source: Memory allocation error when setting
kk: Баптау кезінде жадыны бөлу қатесі
ko: 설정시 메모리 할당 오류
ro: Eroare de alocare a memoriei la configurare

source: Memory allocation error
kk: Жадыны бөлу қатесі
ko: 메모리 할당 오류
ro: Eroare de alocare a memoriei

source: The password is the same as the old one
kk: Пароль алдындағысымен бірдей
ko: 비밀번호가 이전 것과 동일함
ro: Parola este aceeași cu cea veche

source: The password is a palindrome
kk: Пароль палиндром болып табылады
ko: 비밀번호가 앞뒤 어느 쪽에서 읽어도 같은 문맥입니다
ro: Parola este un palindrom

source: The password differs with case changes only
kk: Пароль тек таңбалардың регистрмен ғана ерекшеленеді
ko: 비밀번호는 대소문자로만 바뀌었습니다
ro: Parola diferă doar prin schimbarea minusculelor/majusculelor

source: The password is too similar to the old one
kk: Пароль алдындағысына тым ұқсайды
ko: 비밀번호가 이전 것과 너무 비슷합니다
ro: Parola este prea asemănătoare cu cea veche

source: The password contains the user name in some form
kk: Пароль ішінде қандай да бір түрде пайдаланушы аты бар
ko: 비밀번호에 사용자 이름이 있습니다
ro: Parola conține de-o anumită manieră numele utilizatorului

source: The password contains words from the real name of the user in some form
kk: Пароль ішінде қандай да бір түрде пайдаланушы атынан сөздер бар
ko: 비밀번호는 임의의 형태로 사용자의 실제 이름 단어가 있습니다
ro: Parola conține cuvinte din numele real al utilizatorului sub o formă oarecare

source: The password contains forbidden words in some form
kk: Пароль ішінде қандай да бір түрде рұқсат етілмеген сөздер бар
ko: 비밀번호는 어떤 형태로 금지된 단어가 있습니다
ro: Parola conține cuvinte interzise într-o formă sau alta

source: The password contains less than %ld digits
kk: Парольде %ld шамасынан аз цифр бар
ko: 비밀번호는 %ld개 미만의 숫자가 있습니다
ro: Parola conține mai puțin de %ld caractere

source: The password contains too few digits
kk: Парольде тым аз цифр бар
ko: 비밀번호가 너무 적은 자리 수입니다
ro: Parola conține prea puține caractere

source: The password contains less than %ld uppercase letters
kk: Пароль ішінде %ld бас әріптен аз болып тұр
ko: 비밀번호는 %ld개 미만의 대문자가 있습니다
ro: Parola conține mai puțin de %ld majuscule

source: The password contains too few uppercase letters
kk: Пароль ішінде бас әріптер саны жекткіліксіз
ko: 비밀번호가 너무 적은 대문자의 개수입니다
ro: Parola conține prea puține majuscule

source: The password contains less than %ld lowercase letters
kk: Пароль ішінде %ld кіші әріптен аз болып тұр
ko: 비밀번호는 %ld개 미만의 소문자가 있습니다
ro: Parola conține mai puțin de %ld litere minuscule

source: The password contains too few lowercase letters
kk: Пароль ішінде кіші әріптер саны жекткіліксіз
ko: 비밀번호는 소문자 개수가 부족합니다
ro: Parola conține prea puține litere minuscule

source: The password contains less than %ld non-alphanumeric characters
kk: Парольде әріптік-сандық емес таңбалар саны %ld шамасынан аз
ko: 비밀번호는 영숫자가 아닌 %ld개 미만의 문자가 있습니다
ro: Parola conține mai puțin de %ld caractere non-alfanumerice

source: The password contains too few non-alphanumeric characters
kk: Парольде әріптік-сандық емес таңбалар саны тым аз
ko: 비밀번호는 너무 적은 비-영숫자 문자가 있습니다
ro: Parola conține prea puține caractere non-alfanumerice

source: The password is shorter than %ld characters
kk: Парольде кем дегенде %ld таңба болуы тиіс
ko: 비밀번호는 %ld 개의 문자 보다 짧습니다
ro: Parola este mai scurtă de %ld caractere

source: The password is too short
kk: Пароль тым қысқа
ko: 비밀번호가 너무 짧습니다
ro: Parola este prea scurtă

source: The password is just rotated old one
kk: Пароль ескі парольдің аударылған пішімінде болып тұр
ko: 비밀번호가 이전 것을 회전 적용하였습니다
ro: Parola este doar una veche rotită

source: The password contains less than %ld character classes
kk: Парольде %ld шамасынан аз әр түрлі таңбалар кластары бар
ko: 비밀번호는 %ld 미만의 문자 계열이 들어있습니다
ro: Parola conține mai puțin de %ld clase de caractere

source: The password does not contain enough character classes
kk: Парольде жеткілікті таңбалар кластар саны жоқ
ko: 비밀번호는 다양한 문자 계열을 반영하지 않았습니다
ro: Parola nu conține suficiente clase de caractere

source: The password contains more than %ld same characters consecutively
kk: Парольде қатарынан %ld астам бірдей таңбалар бар
ko: 비밀번호는 %ld개 이상의 동일한 연속 문자가 있습니다
ro: Parola conține mai mult de %ld caractere identice consecutive

source: The password contains too many same characters consecutively
kk: Парольде қатарынан тым көп бірдей таңбалар бар
ko: 비밀번호는 너무 많은 동일한 연속 문자가 있습니다
ro: Parola conține prea multe caractere identice consecutive

source: The password contains more than %ld characters of the same class consecutively
kk: Парольде бір класқа жататын қатарынан %ld таңба бар
ko: 비밀번호는 %ld개 이상의 동일한 계열 연속 문자가 있습니다
ro: Parola conține mai mult de %ld caractere din aceeași clasă consecutive

source: The password contains too many characters of the same class consecutively
kk: Парольде бір класқа жататын қатарынан тым көп таңба бар
ko: 비밀번호는 동일한 계열 문자가 너무 많이 있습니다
ro: Parola conține prea multe caractere din aceeași clasă consecutiv

source: The password contains monotonic sequence longer than %ld characters
kk: Парольде ұқсас таңбалардың %ld таңбадан ұзын тізбегі бар
ko: 비밀번호는 %ld자를 초과하는 단조로운 문자열이 있습니다
ro: Parola conține o secvență monotonă mai lungă de %ld caractere

source: The password contains too long of a monotonic character sequence
kk: Парольде ұқсас таңбалардың тым ұзын тізбегі бар
ko: 비밀번호는 너무 단조로운 문자열이 있습니다
ro: Parola conține o secvență de caractere monotonă prea lungă

source: No password supplied
kk: Пароль көрсетілмеді
ko: 비밀번호가 없습니다
ro: Nu a fost furnizată nicio parolă

source: Cannot obtain random numbers from the RNG device
kk: RNG құрылғысынан кездейсоқ сандарды алу мүмкін емес
ko: RNG 장치에서 임의의 숫자를 가져올 수 없습니다
ro: Nu se pot obține numere aleatorii de la dispozitivul RNG

source: Password generation failed - required entropy too low for settings
kk: Парольді жасау сәтсіз аяқталды - параметрлер үшін қажетті энтропия тым аз
ko: 비밀번호 생성 실패 - 필요한 엔트로피 값이 너무 작습니다
ro: Generarea parolei a eșuat; entropia necesară este prea mică pentru configurare

source: The password fails the dictionary check
kk: Пароль сөздікті тексеруден өтпеді
ko: 비밀번호 사전 검사에 실패했습니다
ro: Parola nu trece proba „verificarea dicționarului”

source: Unknown setting
kk: Белгісіз баптау
ko: 알 수 없는 설정
ro: Configurare necunoscută

source: Bad integer value of setting
kk: Баптаудың жарамсыз бүтін мәні
ko: 잘못된 정수 설정 값
ro: Valoare întreagă greșită a parametrului

source: Bad integer value
kk: Жарамсыз бүтін мәні
ko: 잘못된 정수 값
ro: Valoare întreagă eronată

source: Setting %s is not of integer type
kk: %s баптауы бүтін сан түріне жатпайды
ko: %s 설정은 정수 형식이 아닙니다
ro: Valoarea parametrului %s nu este de tip întreg

source: Setting is not of integer type
kk: Баптау бүтін сан түріне жатпайды
ko: 정수 형식의 설정이 아닙니다
ro: Valoarea parametrului nu este de tip întreg

source: Setting %s is not of string type
kk: %s баптауы жол түріне жатпайды
ko: %s 설정은 문자열 형식이 아닙니다
ro: Valoarea parametrului %s nu este de tip șir de caractere

source: Setting is not of string type
kk: Баптау жол түріне жатпайды
ko: 문자열 형식의 설정이 아닙니다
ro: Valoarea parametrului nu este de tip șir de caractere

source: Opening the configuration file failed
kk: Баптаулар файлын ашу сәтсіз аяқталды
ko: 설정 파일 열기에 실패했습니다
ro: Deschiderea fișierului de configurare a eșuat

source: The configuration file is malformed
kk: Баптаулар файлының пішімі жарамсыз
ko: 설정 파일이 잘못되었습니다
ro: Fișierul de configurare este incorect

source: Fatal failure
kk: Қатаң қате
ko: 치명적인 오류가 발생했습니다
ro: Eșec fatal

source: Unknown error
kk: Белгісіз қате
ko: 알 수 없는 오류
ro: Eroare necunoscută
