Repository: libpwquality/libpwquality
Catalog: po/ie.po
Languages: ie

source: BAD PASSWORD: %s
ie: INVALID CONTRASIGNE: %s

source: Usage: %s [user]
ie: Usage: %s [usator]

source: Error: %s
ie: Errore: %s

source: Could not obtain the password to be scored
ie: Ne successat obtener un contrasigne por evaluation

source: Password quality check failed: %s
ie: Control de qualitá de un contrasigne ne successat: %s

source: Usage: %s <entropy-bits>
ie: Usage: %s <bits-de-entropie>

source: The password is the same as the old one
ie: Li contrasigne es li sam quam li anteyan

source: The password is a palindrome
ie: Li contrasigne es un palindrom

source: The password differs with case changes only
ie: Li contrasigne es diferent solmen in majuscules/minuscules

source: The password is too similar to the old one
ie: Li contrasigne es tro simil al anteyan

source: The password contains the user name in some form
ie: Li contrasigne contene un variation del nómine del usator

source: The password contains words from the real name of the user in some form
ie: Li contrasigne contene variationes de paroles del nómine complet del usator

source: The password contains forbidden words in some form
ie: Li contrasigne contene variationes de prohibit paroles

source: The password contains less than %ld digits
ie: Li contrasigne contene minu quam %ld ciffres

source: The password contains too few digits
ie: Li contrasigne contene tro poc ciffres

source: The password contains less than %ld uppercase letters
ie: Li contrasigne contene minu quam %ld majuscules

source: The password contains too few uppercase letters
ie: Li contrasigne contene tro poc majuscules

source: The password contains less than %ld lowercase letters
ie: Li contrasigne contene minu quam %ld minuscules

source: The password contains too few lowercase letters
ie: Li contrasigne contene tro poc minuscules

source: The password contains less than %ld non-alphanumeric characters
ie: Li contrasigne contene minu quam %ld special simboles

source: The password contains too few non-alphanumeric characters
ie: Li contrasigne contene tro poc special simboles

source: The password is shorter than %ld characters
ie: Li contrasigne es plu curt quam %ld caracteres

source: The password is too short
ie: Li contrasigne es tro curt

source: The password is just rotated old one
ie: Li contrasigne es un rotation del anteyan

source: The password contains less than %ld character classes
ie: Li contrasigne contene minu quam %ld classes de caracteres

source: The password does not contain enough character classes
ie: Li contrasigne contene tro poc classes de caracteres

source: The password contains more than %ld same characters consecutively
ie: Li contrasigne contene plu quam %ld identic caracteres sequentivmen

source: The password contains too many same characters consecutively
ie: Li contrasigne contene tro mult identic caracteres sequentivmen

source: The password contains more than %ld characters of the same class consecutively
ie: Li contrasigne contene plu quam %ld consequent caracteres del sam classe

source: The password contains too many characters of the same class consecutively
ie: Li contrasigne contene tro mult consequent caracteres del sam classe

source: The password contains monotonic sequence longer than %ld characters
ie: Li contrasigne contene un sequentie monotonic de plu quam %ld caracteres

source: The password contains too long of a monotonic character sequence
ie: Li contrasigne contene un tro long sequentie monotonic de caracteres

source: No password supplied
ie: Null contrasigne providet

source: Unknown setting
ie: Ínconosset parametre

source: Unknown error
ie: Inconosset errore
